DataProcessors/ПроверкаПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ПроверкаПочты</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/Задача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Задача</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЗадачи</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостановщикЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроектГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокЗадачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоШаблон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьЗадачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетныйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контакты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗатраченоЧасовФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗатраченоЧасовПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подзадачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подзадача</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>telegram</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовыйПрофиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПочтовыеПрофили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контакты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипКонтакта</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уведомлять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Проекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Проекты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаЧас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерАбонплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контакты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контакты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ПроверкаПочты/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	
	ОсновнойПрофиль = НайтиОсновнойПрофильIMAP();
	
	Если ОсновнойПрофиль <> Неопределено Тогда
		
		Профиль.ИспользоватьSSLIMAP = ОсновнойПрофиль.ИспользоватьSSLIMAP;
		Профиль.АдресСервераIMAP 	= ОсновнойПрофиль.АдресСервераIMAP;
		Профиль.ПортIMAP 			= ОсновнойПрофиль.ПортIMAP; 	
		Профиль.ПользовательIMAP 	= ОсновнойПрофиль.ПользовательIMAP;
		Профиль.ПарольIMAP 			= ОсновнойПрофиль.ПарольIMAP;
		Профиль.ТолькоЗащищеннаяАутентификацияIMAP = ОсновнойПрофиль.ТолькоЗащищеннаяАутентификацияIMAP;
		
	Иначе
		
		Отказ = Истина;
		
	КонецЕсли; 
	
	Почта = Новый ИнтернетПочта;
	Сообщ = Новый СообщениеПользователю();
	
	Попытка
		Почта.Подключиться(Профиль, ПротоколИнтернетПочты.IMAP);		
		// Получаем все сообщения из почтового ящика
		МассивСообщений = Новый Массив;
		МассивСообщений = Почта.Выбрать(Ложь);
	Исключение
		// Ошибка при подключении к серверу или при приеме сообщения обмена
		Сообщ.Текст = " - Ошибка при подключении или приеме" + ОписаниеОшибки();
		Сообщ.Сообщить();
		Возврат;
	КонецПопытки;
	
	// Массив будет содержать сообщения, которые в последствии будут удалены с сервера 
	МассивСообщенийОбмена = Новый Массив;
	Если МассивСообщений.Количество() = 0 Тогда
		// Сообщений в почтовом ящике нет
		Сообщ.Текст = "Сообщений в почтовом ящике нет.";
		Сообщ.Сообщить();
		Возврат;
	КонецЕсли;
	
	ИмяФайлаСообщения = "";
	Для Индекс = 0 По МассивСообщений.Количество() - 1 Цикл  
		ЕстьТакаяЗадача = НайтиЗадачуПоИд(МассивСообщений[Индекс].ИдентификаторСообщения);
		Если ЕстьТакаяЗадача = Неопределено Тогда
			Структ = Новый Структура;
			Структ.Вставить("ИдентификаторСообщения", МассивСообщений[Индекс].ИдентификаторСообщения);
			Структ.Вставить("Тема", МассивСообщений[Индекс].Тема);
			Структ.Вставить("Текст", МассивСообщений[Индекс].Тексты[0].Текст);
			Структ.Вставить("Отправитель", МассивСообщений[Индекс].Отправитель.Адрес);
			ТС = СоздатьЗадачу(Структ);
		КонецЕсли; 
		//Попытка
		//	// Записываем файл 
		//	МассивСообщений[Индекс].Вложения[0].Данные.Записать(ПутьСохранения+"\"+МассивСообщений[Индекс].Вложения[0].ИмяФайла);
		//	Сообщ.Текст = "Принят файл: " + МассивСообщений[Индекс].Вложения[0].ИмяФайла + " с адреса " + Профиль.Пользователь;
		//	Сообщ.Сообщить(); 				
		//Исключение
		//	Сообщ.Текст = "Похоже нет файла в письме ) ";
		//	Сообщ.Сообщить(); 				
		//КонецПопытки;
	КонецЦикла;
	
	Почта.Отключиться(); 
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Функция СоздатьЗадачу(Структ)
	
	СпрЗадача = Справочники.Задача.СоздатьЭлемент();
	СпрЗадача.ДатаСоздания = ТекущаяДата();
	СпрЗадача.ДатаИзменения = ТекущаяДата();
	СпрЗадача.ИдЗадачи = СокрЛП(Структ.ИдентификаторСообщения);
	СпрЗадача.Состояние = Справочники.СостоянияЗадач.Создана;
	СпрЗадача.Наименование = Структ.Тема;
	СпрЗадача.ОписаниеЗадачи = Новый ХранилищеЗначения(Структ.Текст);
	СпрЗадача.ПостановщикЗадачи = Справочники.Пользователи.Почта;
	СпрЗадача.Заказчик = НайтиКонтакт(Структ.Отправитель, "email");
	СпрЗадача.ПроектГруппа = НайтиГруппуКонтакта(СпрЗадача.Заказчик);
	
	Попытка
		СпрЗадача.Записать();
		Рет = "Задача " + СпрЗадача + " создана!";
	Исключение
		Рет = "Ошибка записи задачи: " + ОписаниеОшибки();
	КонецПопытки; 
	
	Возврат Рет;
	
КонецФункции

&НаСервере
Функция НайтиЗадачуПоИд(ИдЗадачи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задача.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Задача КАК Задача
		|ГДЕ
		|	Задача.ИдЗадачи = &ИдЗадачи";
	
	Запрос.УстановитьПараметр("ИдЗадачи", СокрЛП(ИдЗадачи));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 	
	
КонецФункции
 
&НаСервере
Функция НайтиКонтакт(ЧтоИскать, Тип = "email")
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контакты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контакты КАК Контакты
		|ГДЕ
		|	(Контакты.ЭлПочта = &ЧтоИскать)
		|	И НЕ Контакты.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ЧтоИскать", ЧтоИскать);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
 
&НаСервере
Функция НайтиГруппуКонтакта(Конт)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроектыКонтакты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Проекты.Контакты КАК ПроектыКонтакты
		|ГДЕ
		|	ПроектыКонтакты.Контакт = &Конт";
	
	Запрос.УстановитьПараметр("Конт", Конт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция НайтиОсновнойПрофильIMAP()
	
	Если ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь.ПочтовыйПрофиль) Тогда
		Возврат ПараметрыСеанса.ТекущийПользователь.ПочтовыйПрофиль;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
КонецФункции
